---
kind: method
id: M:Autodesk.Revit.DB.Structure.RebarTrimExtendData.ClearAllAddedBarGeometry
source: html/f1450c93-30ed-79cf-0acd-3619cb170428.htm
---
# Autodesk.Revit.DB.Structure.RebarTrimExtendData.ClearAllAddedBarGeometry Method

This function will remove all bars geometry that were added by calling AddBarGeometry().

## Syntax (C#)
```csharp
public void ClearAllAddedBarGeometry()
```